УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_ГруппыУслуг/УПЖКХ_ГруппыУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УПЖКХ_ГруппыУслуг</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НастройкиОтраженияНачислений</name>
      <description>Для отражения начислений в регл.учете</description>
    </items>
    <items>
      <name>НастройкиРасчётаЛьгот</name>
      <description>Настройки расчёта льгот</description>
    </items>
  </predefined>
  <attributes>
    <name>ОписаниеВидаГрупп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_ГруппыУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Вызывается из обработки обновления при начальном заполнении ИБ 
// для обновления параметров предопределенных видов групп услуг.
//
// Параметры:
//   ВидГруппОтбор - ссылка на вид групп - обновляемый вид групп, если передан;
//                                         если не передан, обновляются все виды групп.
//
Процедура ОбновитьДанныеПредопределенныхВидовГрупп(ВидГруппОтбор = Неопределено) Экспорт
	
	// Вид групп "Настройки расчёта льгот".
	ВидГрупп = ПредопределенноеЗначение("Справочник.УПЖКХ_ГруппыУслуг.НастройкиРасчётаЛьгот");
	Описание = НСтр("ru='Используется для установки различных настроек предоставления и расчета льгот для произвольных групп услуг. "
					  + "Например, по одной группе услуг льгота может предоставляться зарегистрированным льготникам, а по другой - проживающим.'");
	УстановитьСвойстваВидаГрупп(ВидГрупп, ВидГруппОтбор, Описание);
	
	// Вид групп "Настройки отражения начислений".
	ВидГрупп = ПредопределенноеЗначение("Справочник.УПЖКХ_ГруппыУслуг.НастройкиОтраженияНачислений");
	Описание = НСтр("ru='Используется для отражения начислений в регл.учете по группе услуг. "
					  + "Например, по одной группе услуг при отражении начислений в БУ могут формироваться документы реализации, а по другой - акты об оказании производственных услуг. "
					  + "Если при отражении начислений группу не указывать, то отражение производится по всем услугам, не входящим ни в одну из групп для отражения начислений в регл.учете.'");
	УстановитьСвойстваВидаГрупп(ВидГрупп, ВидГруппОтбор, Описание);
	
	// Добавление нового предопределенного элемента:
	
	//// Вид групп "<Синоним вида групп>".
	//ВидГрупп = ПредопределенноеЗначение("Справочник.УПЖКХ_ГруппыУслуг.<Имя вида групп>");
	//Описание = НСтр("ru='<Текстовое описание>'");
	//УстановитьСвойстваВидаГрупп(ВидГрупп, ВидГруппОтбор, Описание);
	
КонецПроцедуры

// Устанавливает свойства вида групп.
//
Процедура УстановитьСвойстваВидаГрупп(ВидГрупп, ВидГруппОтбор = Неопределено, Описание = "")
	
	// Обновление текущего вида групп производим в случаях, когда вид групп
	// для обновления не уточнен, или уточнен и совпадает с обновляемым видом групп.
	Если ВидГруппОтбор = Неопределено
	 Или ВидГрупп = ВидГруппОтбор Тогда
		
		ВидОбъект = ВидГрупп.ПолучитьОбъект();
		ВидОбъект.ОписаниеВидаГрупп = Описание;
		КВП_ЗаписатьОбъект(ВидОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
